# apply functions

In [1]:
import pandas as pd

In [2]:
# Create an example dataframe
data = {'Platoon': ['A','A','A','A','A','A','B','B','B','B','B','C','C','C','C','C'],
       'Casualties': [1,4,5,7,5,5,6,1,4,5,6,7,4,6,4,6]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   Platoon  Casualties
0        A           1
1        A           4
2        A           5
3        A           7
4        A           5
5        A           5
6        B           6
7        B           1
8        B           4
9        B           5
10       B           6
11       C           7
12       C           4
13       C           6
14       C           4
15       C           6

In [7]:
df.groupby(['Platoon'])['Casualties'].apply(lambda x: x.rolling(window = 2, center = False).mean())

0     NaN
1     2.5
2     4.5
3     6.0
4     6.0
5     5.0
6     NaN
7     3.5
8     2.5
9     4.5
10    5.5
11    NaN
12    5.5
13    5.0
14    5.0
15    5.0
Name: Casualties, dtype: float64

In [8]:
# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [9]:
df = pd.DataFrame(raw_data)

In [10]:
df

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [11]:
# Create a groupby variable that groups preTestScores by regiment
df.groupby(['regiment'])['preTestScore'].describe()

            count   mean        std  min   25%   50%    75%   max
regiment
Dragoons      4.0  15.50  14.153916  3.0  3.75  14.0  25.75  31.0
Nighthawks    4.0  15.25  14.453950  2.0  3.50  14.0  25.75  31.0
Scouts        4.0   2.50   0.577350  2.0  2.00   2.5   3.00   3.0

In [12]:
df.groupby(['regiment'])['preTestScore'].mean()

regiment
Dragoons      15.50
Nighthawks    15.25
Scouts         2.50
Name: preTestScore, dtype: float64

In [13]:
df.groupby(['regiment', 'company'])['preTestScore'].mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

In [14]:
df.groupby(['regiment', 'company'])['preTestScore'].mean().unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

In [15]:
df.groupby(['regiment', 'company']).mean()

                    preTestScore  postTestScore
regiment   company
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

In [17]:
df.groupby(['regiment', 'company']).size()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

In [18]:
# iterate over groups
for name, group in df.groupby(['regiment']):
    print(name)
    print(group)

Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70

In [22]:
list(df.groupby(df.dtypes, axis =1))

[(dtype('int64'),     preTestScore  postTestScore
  0              4             25
  1             24             94
  2             31             57
  3              2             62
  4              3             70
  5              4             25
  6             24             94
  7             31             57
  8              2             62
  9              3             70
  10             2             62
  11             3             70),
 (dtype('O'),       regiment company      name
  0   Nighthawks     1st    Miller
  1   Nighthawks     1st  Jacobson
  2   Nighthawks     2nd       Ali
  3   Nighthawks     2nd    Milner
  4     Dragoons     1st     Cooze
  5     Dragoons     1st     Jacon
  6     Dragoons     2nd    Ryaner
  7     Dragoons     2nd      Sone
  8       Scouts     1st     Sloan
  9       Scouts     1st     Piger
  10      Scouts     2nd     Riani
  11      Scouts     2nd       Ali)]

In [23]:
df.groupby(['regiment']).mean().add_prefix('group_mean_')

            group_mean_preTestScore  group_mean_postTestScore
regiment
Dragoons                      15.50                      61.5
Nighthawks                    15.25                      59.5
Scouts                         2.50                      66.0

In [26]:
def get_stats(group):
    d_min = group.min()
    d_max = group.max()
    d_count = group.count()
    d_mean = group.mean()
    return{d_min, d_max, d_count, d_mean}

In [31]:
bins = [0,25,50,75,100]
group_name = ['low', 'ok', 'good', 'great']
df['Categories'] = pd.cut(df['postTestScore'], bins, labels = group_name)

In [39]:
df.groupby('Categories')['postTestScore'].apply(get_stats)

Categories
low                 {25, 2}
ok                 {nan, 0}
good     {8, 57, 70, 63.75}
great               {2, 94}
Name: postTestScore, dtype: object

In [40]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}

In [41]:
new_df = pd.DataFrame(data)

In [42]:
new_df

    name  year  reports  coverage
0  Jason  2012        4        25
1  Molly  2012       24        94
2   Tina  2013       31        57
3   Jake  2014        2        62
4    Amy  2014        3        70

In [43]:
caps = lambda x: x.upper()

In [45]:
new_df.name.apply(caps)

0    JASON
1    MOLLY
2     TINA
3     JAKE
4      AMY
Name: name, dtype: object

In [47]:
new_df.name.apply(lambda x: x.upper())

0    JASON
1    MOLLY
2     TINA
3     JAKE
4      AMY
Name: name, dtype: object

In [51]:
new_df.name.apply(caps)

0    JASON
1    MOLLY
2     TINA
3     JAKE
4      AMY
Name: name, dtype: object

In [53]:
fin_df = new_df.drop(['name'], axis = 1)

In [56]:
fin_df.year.apply(lambda x: x + 10)

0    2022
1    2022
2    2023
3    2024
4    2024
Name: year, dtype: int64

In [57]:
fin_df[:2].apply(lambda x: x + 10)

   year  reports  coverage
0  2022       14        35
1  2022       34       104

In [59]:
fin_df.year.map(lambda x: x + 10)

0    2022
1    2022
2    2023
3    2024
4    2024
Name: year, dtype: int64

In [60]:
fin_df.applymap(lambda x: x + 10)

   year  reports  coverage
0  2022       14        35
1  2022       34       104
2  2023       41        67
3  2024       12        72
4  2024       13        80

In [61]:
# apply works row and column wise
# map works only for series (a single column)
# applymap works for all elements of df

In [63]:
# assign new column
fin_df['new_col'] = [1,1,2,4,5]

In [64]:
fin_df

   year  reports  coverage  new_col
0  2012        4        25        1
1  2012       24        94        1
2  2013       31        57        2
3  2014        2        62        4
4  2014        3        70        5

In [67]:
fin_df.assign(age= [23,44,33,44,11])

   year  reports  coverage  new_col  age
0  2012        4        25        1   23
1  2012       24        94        1   44
2  2013       31        57        2   33
3  2014        2        62        4   44
4  2014        3        70        5   11